Revit 2024 API
TableSectionData.CanInsertColumn Method
 Verifies if a new column can be inserted at the given index.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool CanInsertColumn(
	int nIndex
)
Visual Basic
Public Function CanInsertColumn ( _
	nIndex As Integer _
) As Boolean
Visual C++
public:
bool CanInsertColumn(
	int nIndex
)
Parameters
nIndex
Type: System.Int32
 An integer index.
Return Value
 True if the column can be inserted, false otherwise.
See Also
TableSectionData Class
Autodesk.Revit.DB Namespace